       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARRAFOS-SECCIONES.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77  WS-NUM1 PIC S9(3).
       77  WS-NUM2 PIC S9(3).
       77  WS-RESUL PIC S9(4).
       PROCEDURE DIVISION.

       PERFORM INGRESAR-NUMEROS. *> UTILIZAMOS PERFORM PARA EJECUTAR UN
                                 *> PARRAFO EN PARTICULAR
       PERFORM CALCULAR-SUMA.
       PERFORM MOSTRAR-RESULTADO.

       STOP RUN.
           
       INGRESAR-NUMEROS.
           DISPLAY "INGRESE NUMERO 1: " WITH NO ADVANCING
           ACCEPT WS-NUM1
    
           DISPLAY "INGRESE NUMERO 2: " WITH NO ADVANCING
           ACCEPT WS-NUM2.
       
       CALCULAR-SUMA.
           COMPUTE WS-RESUL=WS-NUM1+WS-NUM2.

       MOSTRAR-RESULTADO.
           DISPLAY "EL RESULTADO DE SUMAR SUS NUMEROS ES: " WS-RESUL.
       
       



          