       IDENTIFICATION DIVISION.
       PROGRAM-ID. ESTRUCTURASITER.

       PROCEDURE DIVISION.

      *ITERACION INCONDICIONAL -> PERFORM PARRAFO 25 TIMES
      *                        L->EJECUTA EL PARRAFO 25 VECES    

      *ITERACION CONDICIONAL:
       
      *PERFORM PARRAFO WITH TEST BEFORE/AFTER
      * VARYING VARIABLE FROM VALOR1 BY VALOR2 
      *  UNTIL CONDICION

      *PERFORM PARRAFO WITH TEST BEFORE/AFTER UNTIL CONDICION

      *EN TODOS LOS CASOS EL PERFORM PUEDE HACERSE CON UN PARRAFO O
      *SENTENCIAS SUELTAS DE LA SIGUIENTE FORMA:
      *    PERFORM <CONDICIONES DE ITERACION>
      *         SENTENCIAS
      *    END-PERFORM.

      *WITH TEST BEFORE/AFTER MODIFICA CUANDO SE EVALUA LA CONDICION DE
      *CORTE.

      *CON EXIT PERFORM CYCLE PODEMOS SALTAR A LA SIGUIENTE ITERACION
      *DE LOS BUCLES, EQUIVALENTE AL CONTINUE DE OTROS LENGUAJES