       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARA-SECT.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 NUMERO1 PIC 9(3).
       77 NUMERO2 PIC 9(3).

       77 RESULTADO PIC 9(4).
       procedure division.

       PERFORM REALIZAR-Y-MOSTRA-SUMA.
       DISPLAY "A".
       STOP RUN.

       REALIZAR-Y-MOSTRA-SUMA SECTION.*>ESTO ES UNA SECCION Y CON ELLA
                                      *>PODEMOS AGRUPAR PARRAFOS

           INGRESAR-NUMEROS. *> ESTO ES UN PARRAFO Y LO UTILIZAMOS PARA
                             *> AGRUPAR SENTENCIAS.
               ACCEPT NUMERO1
               ACCEPT NUMERO2. *> LA ULTIMA SENTENCIA DEBE TENER SI O SI
                               *> PUNTO FINAL PARA MARCAR EL FIN DEL
                               *> PARRAFO.
           
           SUMAR-NUMEROS.
               COMPUTE RESULTADO = NUMERO1 + NUMERO2.

           EXIT SECTION *> RETORNA AL PUNTO DE LLAMADO DE LA SECCION

           DISPLAY "B".*> NO SE EJECUTA

       *> PARA CERRAR LA SECCION PODEMOS COMENZAR OTRA O HACERLO CON
       *> EXIT SECTION -> FUERZA LA SALIDA DE LA SECCION (OLVIDE MENCIONARLO)

       *> EL FLUJO DE EJECUCION SERIA:
       *>  1_ INGRESA A LA SECCION.
       *>  2_ SE INGRESAN LOS NUMEROS.
       *>  3_ SE SUMAN LOS NUMEROS Y SE GUARDA EL RESULTADO.
       *>  4_ SE EJECUTA LA SALIDA DE LA SECCION
       *>  5_ SE MUESTRA "A".
       *>  6_ FIN DEL PROGRAMA.