       IDENTIFICATION DIVISION.
       PROGRAM-ID. SECCIONES.
       DATE-COMPILED. 07/02/2026 . *>OPCIONAL
       DATE-WRITTEN. 07/02/2026 . *>OPCIONAL
       AUTHOR. GERMAN. *>

       ENVIRONMENT DIVISION.
           *>AQUI DECLARAMOS TODAS LAS VARIABLES QUE HACEN AL ENTORNO
           *>EN EL CUAL SE EJECUTARA EL PROGRAMA(ACTUALMENTE
           *>CONFIGURATION SECTION NO SE UTILIZA CASI)
           CONFIGURATION SECTION. 
               SOURCE-COMPUTER.
                   BCRA-System.
               OBJECT-COMPUTER.
                   BANK-System.
               SPECIAL-NAMES.
                   CLASS DIGIT IS "0" THRU "9".
                   CURRENCY SIGN IS "#".
           
           INPUT-OUTPUT SECTION.*>AQUI SE DECLARAN LAS CUESTIONES
                                *>ASOCIADAS A LOS DISPOSITIVOS DE
                                *>E/S DEL PROGRAMA.
           FILE-CONTROL.
           *>AQUI SE DECLARAN LAS CARACTERISTICAS DE LOS PROGRAMAS CON
           *>LOS QUE VAMOS A TRABAJAR(ORGANIZACION, ACCESO, KEY,ETC).
       DATA DIVISION.
           
           FILE SECTION.

           *>ACA SE DECLARA LA ESTRUCTURA DE LOS ARCHIVOS QUE
           *>PREVIAMENTE DECLARAMOS SUS CARACTERISTICAS EN LA
           *>ENVIRONMENT DIVISION.

           WORKING-STORAGE SECTION.

           *>AQUI SE DECLARAN LOS DATOS QUE SE UTILIZARAN DURANTE LA
           *>EJECUCION DEL PROGRAMA Y QUE SERAN GLOBALES A CADA LLAMADA
           *>RECURSIVA DEL PROGRAMA.

           LOCAL-STORAGE SECTION.

           *>AQUI SE DECLARAN LOS DATOS QUE SE UTILIZARAN DURANTE LA
           *>EJECUCION DEL PROGRAMA Y QUE SERAN LOCALES A CADA LLAMADA
           *>RECURSIVA DEL PROGRAMA.

           LINKAGE SECTION.

           *>EN EL CASO QUE EL PROGRAMA QUE ESTEMOS CODIFICANDO SEA UN
           *>MODULO O FUNCION DE OTRO, AQUI ES DONDE DECLARARIAMOS LOS
           *>PARAMETROS QUE LE ENVIAREMOS.

       PROCEDURE DIVISION. *> USING PARA1, PARA2... (SI ES FUNCION)

           *> SENTENCIA1...
           *> SENTENCIA2...
           *> SENTENCIA3...
       

       STOP RUN.
          