       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATOSBASICOS.

       DATA DIVISION.
           
       WORKING-STORAGE SECTION.
           
           *>##NIVELES DE PERTENENCIA
           *> 01 -> REGISTROS O TABLAS.
           *> 02-49 -> DATOS ESTRUCTURADOS O DATOS INDIVISIBLES DE
           *>          OTRO DATO ESTRUCTURADO(EG,REGISTRO)
           *> 77 -> DATOS INDIVISIBLES INDEPENDIENTES
           *> 88 -> CONDICIONALES ASOCIADOS A UN VALOR

       77  WS-NUMERIC PIC 9(2) VALUE 22 . *> TIPO NUMERICO.
       77  WS-ALNUM   PIC X(2) VALUE "X2". *> TIPO ALFANUMERICO.
       77  WS-ALFABET PIC A(2) VALUE "AS". *> TIPO ALFABETICO.
       77  WS-SIGNUM  PIC S9(2) VALUE +12 . *> TIPO NUMERICO CON SIGNO.
       77  WS-FNUM    PIC 9(2)V9(2) VALUE 22.22 . *> TIPO NUMERICO FLOAT

       *>##METODOS DE EMPAQUETADO:
       *>COMP -> BINARIO -> CONTADORES
       *>COMP-3 -> DECIMAL EMPAQUETADO
       *>COM-5 -> BINARIO PURO -> CALCULO
       *>DISPLAY -> FORMATO PARA MOSTRAR POR PANTALLA(EL UNICO)

       *> EG:
       *>    77 WS-NUMERIC PIC 9(4) USAGE IS COMP-5 VALUE 4444.
